Revit 2026 API

# TextRange(TextRange) Constructor

---

Constructs a copy of the input TextRange object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TextRange(
	TextRange other
)
```
```vb
Public Sub New (
	other As TextRange
)
```
```cpp
public:
TextRange(
	TextRange^ other
)
```
```fsharp
new :
        other : TextRange -> TextRange
```

#### Parameters

other TextRange

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

TextRange Class

TextRange Overload

Autodesk.Revit.DB Namespace